---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegralError
source: html/a962f288-2745-571a-c78c-de0a4af12e7e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegralError Property

Could not create integral reveal for wall instance. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRevealIntegralError { get; }
```